# GraphicsStyleCategory Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
GraphicsStyle..::..GraphicsStyleCategory Property
GraphicsStyle Class See Also
---
The graphics style category.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Category GraphicsStyleCategory { get; }
```

Visual Basic
---
```text
Public ReadOnly Property GraphicsStyleCategory As Category
	Get
```

Visual C++
---
```text
public:
property Category^ GraphicsStyleCategory {
	Category^ get ();
}
```

# See Also
GraphicsStyle Class
Autodesk.Revit.DB Namespace